backend/controllers/AnswerController.php

    protected function findModel($id)
    {
        if (($model = Answer::findOne($id)) !== null) {
---
SELECT * FROM `answer` WHERE `id`='1'