backend/controllers/CategoryController.php

    protected function findModel($id)
    {
        if (($model = Category::findOne($id)) !== null) {
---
SELECT * FROM `category` WHERE `id`='1'