backend/controllers/QuestionController.php

    protected function findModel($id)
    {
        if (($model = Question::findOne($id)) !== null) {
---
SELECT * FROM `question` WHERE `id`='8'