backend/controllers/TechnologyController.php

    protected function findModel($id)
    {
        if (($model = Technology::findOne($id)) !== null) {
---
SELECT * FROM `technology` WHERE `id`='1'