backend/controllers/WikiController.php

SELECT * FROM `wiki` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Wiki::findOne($id)) !== null) {