frontend/views/question/_form.php

?>

<div class="question-form">
	<?php $categories=ArrayHelper::map(Category::find()->all(), 'id', 'category_name'); ?>
	<?php $users=ArrayHelper::map(User::find()->all(), 'id', 'username'); ?>
---
SELECT * FROM `category`
SELECT * FROM `user`