frontend/views/question/index.php

		<div class="col-sm-3">
			<h3 class="text-center">Categories</h3>
			<?php
				$categories=Category::find()->all();
---
SELECT * FROM `category`