frontend/controllers/QuestionController.php

SELECT * FROM `question` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Question::findOne($id)) !== null) {