frontend/controllers/WikiController.php

    protected function findModel($id)
    {
        if (($model = Wiki::findOne($id)) !== null) {
---
SELECT * FROM `wiki` WHERE `id`='2'