common/models/ChangePasswordForm.php

UPDATE `user` SET `password_hash`='$2y$13$DW7Epi1gK0P5eHIRb3jOQuFL4.KX8PxcIeXJdLmnaG51/l/BoJI5.', `updated_at`=1524034622 WHERE `id`=1
---
	public function changePassword()
	{
		$user = $this->_user;
		$user->setPassword($this->new_password);

		return $user->save(false);