frontend/views/answer/_form.php

SELECT * FROM `question`
SELECT * FROM `user`
---
?>

<div class="answer-form">
	<?php $questions=ArrayHelper::map(Question::find()->all(), 'id', 'question_title'); ?>
	<?php $users=ArrayHelper::map(User::find()->all(), 'id', 'username'); ?>