frontend/views/user/_form.php

?>

<div class="user-form">
	<?php $designations=ArrayHelper::map(Designation::find()->all(), 'designation_name', 'designation_name'); ?>
	<?php $technologies=ArrayHelper::map(Technology::find()->all(), 'technology_name', 'technology_name'); ?>
---
SELECT * FROM `designation`
SELECT * FROM `technology`