frontend/views/site/index.php

<div class="col-md-9">
	<h2 class="question-title">Questions</h2>
	<?php
	$questions=Question::find()->all();
---
SELECT * FROM `question`