frontend/views/site/sidebar.php

SELECT * FROM `category`
---
		<h3 class="widget_title">Categories</h3>
		<div class="ul_list">
		<?php
			$categories=Category::find()->all();

SELECT * FROM `wiki` ORDER BY `created_at` DESC LIMIT 5
---
	<div class="widget blogs-widget">
		<h3 class="widget_title">Recent Blogs</h3>
		<?php
			$blogs=Wiki::find()->orderBy(['created_at'=>SORT_DESC])->limit(5)->all();

SELECT * FROM `user` ORDER BY `created_at` DESC LIMIT 5
---
	<div class="widget users-widget">
		<h3 class="widget_title">Recent Users</h3>
		<?php
			$users=User::find()->orderBy(['created_at'=>SORT_DESC])->limit(5)->all();